<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Indexing-DataFrames" data-toc-modified-id="Indexing-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Indexing DataFrames</a></span><ul class="toc-item"><li><span><a href="#Indexing-using-square-brackets" data-toc-modified-id="Indexing-using-square-brackets-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Indexing using square brackets</a></span></li><li><span><a href="#Using-the-.loc-and-.iloc-accessor" data-toc-modified-id="Using-the-.loc-and-.iloc-accessor-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Using the .loc and .iloc accessor</a></span></li><li><span><a href="#Selecting-only-some-columns" data-toc-modified-id="Selecting-only-some-columns-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Selecting only some columns</a></span></li></ul></li><li><span><a href="#Slicing-DataFrames" data-toc-modified-id="Slicing-DataFrames-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Slicing DataFrames</a></span><ul class="toc-item"><li><span><a href="#Using-.loc[]" data-toc-modified-id="Using-.loc[]-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Using .loc[]</a></span></li></ul></li><li><span><a href="#Filtering-DataFrames" data-toc-modified-id="Filtering-DataFrames-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Filtering DataFrames</a></span><ul class="toc-item"><li><span><a href="#Creating-a-Boolean-Series" data-toc-modified-id="Creating-a-Boolean-Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Creating a Boolean Series</a></span></li><li><span><a href="#Filtering-with-a-Boolean-Series" data-toc-modified-id="Filtering-with-a-Boolean-Series-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Filtering with a Boolean Series</a></span></li><li><span><a href="#Combining-filters" data-toc-modified-id="Combining-filters-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Combining filters</a></span></li><li><span><a href="#DataFrames-with-zeros-and-NaNs" data-toc-modified-id="DataFrames-with-zeros-and-NaNs-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>DataFrames with zeros and NaNs</a></span></li><li><span><a href="#Select-column-with-all-nonzeros" data-toc-modified-id="Select-column-with-all-nonzeros-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Select column with all nonzeros</a></span></li><li><span><a href="#Select-columns-with-any-nonzeros" data-toc-modified-id="Select-columns-with-any-nonzeros-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>Select columns with any nonzeros</a></span></li><li><span><a href="#Select-columns-with-any-NaNs" data-toc-modified-id="Select-columns-with-any-NaNs-3.7"><span class="toc-item-num">3.7&nbsp;&nbsp;</span>Select columns with any NaNs</a></span></li><li><span><a href="#Select-columns-without-NaNs" data-toc-modified-id="Select-columns-without-NaNs-3.8"><span class="toc-item-num">3.8&nbsp;&nbsp;</span>Select columns without NaNs</a></span></li><li><span><a href="#Drop-rows-with-any-NaNs" data-toc-modified-id="Drop-rows-with-any-NaNs-3.9"><span class="toc-item-num">3.9&nbsp;&nbsp;</span>Drop rows with any NaNs</a></span></li><li><span><a href="#Filtering-a-column-based-on-another" data-toc-modified-id="Filtering-a-column-based-on-another-3.10"><span class="toc-item-num">3.10&nbsp;&nbsp;</span>Filtering a column based on another</a></span></li><li><span><a href="#Modifying-a-column-based-on-another" data-toc-modified-id="Modifying-a-column-based-on-another-3.11"><span class="toc-item-num">3.11&nbsp;&nbsp;</span>Modifying a column based on another</a></span></li><li><span><a href="#Filtering-using-NaNs" data-toc-modified-id="Filtering-using-NaNs-3.12"><span class="toc-item-num">3.12&nbsp;&nbsp;</span>Filtering using NaNs</a></span></li></ul></li><li><span><a href="#Transforming-DataFrames" data-toc-modified-id="Transforming-DataFrames-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Transforming DataFrames</a></span><ul class="toc-item"><li><span><a href="#DataFrame-vectorized-methods" data-toc-modified-id="DataFrame-vectorized-methods-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>DataFrame vectorized methods</a></span></li><li><span><a href="#NumPy-vectorized-functions" data-toc-modified-id="NumPy-vectorized-functions-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>NumPy vectorized functions</a></span></li><li><span><a href="#Plain-Python-functions" data-toc-modified-id="Plain-Python-functions-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Plain Python functions</a></span></li><li><span><a href="#Storing-a-transformation" data-toc-modified-id="Storing-a-transformation-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Storing a transformation</a></span></li><li><span><a href="#The-DataFrame-Index" data-toc-modified-id="The-DataFrame-Index-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>The DataFrame Index</a></span></li><li><span><a href="#Working-with-string-values" data-toc-modified-id="Working-with-string-values-4.6"><span class="toc-item-num">4.6&nbsp;&nbsp;</span>Working with string values</a></span></li><li><span><a href="#Defining-columns-using-other-columns" data-toc-modified-id="Defining-columns-using-other-columns-4.7"><span class="toc-item-num">4.7&nbsp;&nbsp;</span>Defining columns using other columns</a></span></li><li><span><a href="#Using-apply()-to-transform-a-column" data-toc-modified-id="Using-apply()-to-transform-a-column-4.8"><span class="toc-item-num">4.8&nbsp;&nbsp;</span>Using apply() to transform a column</a></span></li><li><span><a href="#Using-.map()-with-a-dictionary" data-toc-modified-id="Using-.map()-with-a-dictionary-4.9"><span class="toc-item-num">4.9&nbsp;&nbsp;</span>Using .map() with a dictionary</a></span></li><li><span><a href="#Using-vectorized-functions" data-toc-modified-id="Using-vectorized-functions-4.10"><span class="toc-item-num">4.10&nbsp;&nbsp;</span>Using vectorized functions</a></span></li></ul></li></ul></div>

# Indexing DataFrames

In [19]:
import pandas as pd 
eggs = pd.read_csv('sales.csv', index_col = 'month')
eggs

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## Indexing using square brackets

In [20]:
# Сначала выбирается столбец, затем строка
eggs['salt']['Jan']

12.0

In [21]:
eggs.eggs['May']

132

## Using the .loc and .iloc accessor

In [22]:
# А здесь наоборот - сначала строка, затем стоблец
eggs.loc['Apr', 'salt']

87.0

In [23]:
eggs.iloc[3, 1]

87.0

## Selecting only some columns

In [24]:
egg_new = eggs[['eggs', 'salt']] 
egg_new

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [25]:
egg_new_2 = eggs[['salt', 'eggs']]
egg_new_2

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

# Slicing DataFrames

In [26]:
eggs['salt']

month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0
Name: salt, dtype: float64

In [27]:
type(eggs['salt'])

pandas.core.series.Series

In [28]:
eggs['salt'][1:4]

month
Feb    50.0
Mar    89.0
Apr    87.0
Name: salt, dtype: float64

In [29]:
eggs['salt'][3]

87.0

## Using .loc[]

In [30]:
# Sliing add both columns - eggs and salt
eggs.loc[:, 'eggs':'salt']

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [31]:
eggs.loc['Mar':'Jun', :]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [32]:
eggs.loc['Mar':'Apr', 'salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20

In [65]:
election = pd.read_csv('pennsylvania2012_turnout.csv', index_col='county')
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [66]:
p_countries = election.loc['Allegheny':'Beaver', :]
p_countries

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012

In [68]:
p_countries_rev = election.loc['Beaver':'Allegheny':-1]
p_countries_rev

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399

In [69]:
# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election.loc[:, :'Obama']

# Print the output of left_columns.head()
print(left_columns.head())

# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election.loc[:, 'Obama':'winner']

# Print the output of middle_columns.head()
print(middle_columns.head())

# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election.loc[:, 'Romney':]

# Print the output of right_columns.head()
print(right_columns.head())

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452
               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney
              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118

In [70]:
# Create the list of row labels: rows
rows = ['Philadelphia', 'Centre', 'Fulton']

# Create the list of column labels: cols
cols = ['winner', 'Obama', 'Romney']

# Create the new DataFrame: three_counties
three_counties = election.loc[rows, cols]

# Print the three_counties DataFrame
print(three_counties)

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

# Filtering DataFrames

## Creating a Boolean Series

In [33]:
eggs.salt > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

## Filtering with a Boolean Series

In [72]:
titanic = pd.read_csv('titanic.csv')
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [34]:
eggs[eggs.salt >60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [35]:
enough_salt_sold = eggs.salt > 60 
eggs[enough_salt_sold]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

## Combining filters

In [36]:
eggs[(eggs.salt >=50) & (eggs.eggs < 200)] #both conditions

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [38]:
eggs[(eggs.salt >= 50) | (eggs.eggs < 200)] #either conditions

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## DataFrames with zeros and NaNs

In [43]:
eggs2 = eggs.copy()
eggs2['bacon'] = [0, 0, 50, 60, 70, 80] 
eggs2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

## Select column with all nonzeros

In [45]:
eggs2.loc[:, eggs2.all()] #Deletin columns with 0, not NaN entries

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## Select columns with any nonzeros

In [46]:
# Choose if there aro zero columns
eggs2.loc[:, eggs2.any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

## Select columns with any NaNs

In [47]:
eggs2.loc[:, eggs2.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

## Select columns without NaNs

In [49]:
eggs2.loc[:, eggs2.notnull().all()]

       eggs  spam  bacon
month
Jan      47    17      0
Feb     110    31      0
Mar     221    72     50
Apr      77    20     60
May     132    52     70
Jun     205    55     80

## Drop rows with any NaNs

In [50]:
eggs2.dropna(how='any') #Dropping the "May" row
#there should be at least one NaN entry

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
Jun     205  60.0    55     80

In [53]:
eggs2.dropna(how='all') 
#Keeping the "May" row. There should be all NaN 
#on the row

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

## Filtering a column based on another

In [55]:
eggs.eggs[eggs.salt > 55]

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

## Modifying a column based on another

In [57]:
eggs.eggs[eggs.salt > 55] += 5
eggs

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     231  89.0    72
Apr      87  87.0    20
May     132   NaN    52
Jun     215  60.0    55

## Filtering using NaNs

In [73]:
# Select the 'age' and 'cabin' columns: df
df = titanic.loc[:,['age','cabin']]

# Print the shape of df
print(df.shape)

# Drop rows in df with how='any' and print the shape
print(df.dropna(how='any').shape)

# Drop rows in df with how='all' and print the shape
print(df.dropna(how='all').shape)

(1309, 2)
(272, 2)
(1069, 2)

# Transforming DataFrames

## DataFrame vectorized methods

In [77]:
eggs.floordiv(12) #Convert to dozens unit

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      19   7.0     6
Apr       7   7.0     1
May      11   NaN     4
Jun      17   5.0     4

## NumPy vectorized functions

In [82]:
import numpy as np 

np.floor_divide(eggs, 12) #Convert to dozen unit

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: RuntimeWarning: invalid value encountered in floor_divide
  This is separate from the ipykernel package so we can avoid doing imports until

       eggs  salt  spam
month
Jan     3.0   1.0   1.0
Feb     9.0   4.0   2.0
Mar    19.0   7.0   6.0
Apr     7.0   7.0   1.0
May    11.0   NaN   4.0
Jun    17.0   5.0   4.0

## Plain Python functions

In [80]:
def dozens(n):
    return n/12 

eggs.apply(dozens) #Convert to dozens unit

            eggs      salt      spam
month
Jan     3.916667  1.000000  1.416667
Feb     9.166667  4.166667  2.583333
Mar    19.250000  7.416667  6.000000
Apr     7.250000  7.250000  1.666667
May    11.000000       NaN  4.333333
Jun    17.916667  5.000000  4.583333

In [81]:
eggs.apply(lambda n: n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      19   7.0     6
Apr       7   7.0     1
May      11   NaN     4
Jun      17   5.0     4

## Storing a transformation

In [83]:
eggs['dozens_of_eggs'] = eggs.eggs.floordiv(12) 
eggs

       eggs  salt  spam  dozens_of_eggs
month
Jan      47  12.0    17               3
Feb     110  50.0    31               9
Mar     231  89.0    72              19
Apr      87  87.0    20               7
May     132   NaN    52              11
Jun     215  60.0    55              17

## The DataFrame Index

In [84]:
eggs.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

## Working with string values

In [88]:
eggs.index = eggs.index.str.upper()
eggs

       eggs  salt  spam  dozens_of_eggs
month
JAN      47  12.0    17               3
FEB     110  50.0    31               9
MAR     231  89.0    72              19
APR      87  87.0    20               7
MAY     132   NaN    52              11
JUN     215  60.0    55              17

In [90]:
eggs.index = eggs.index.map(str.lower)
eggs

       eggs  salt  spam  dozens_of_eggs
month
jan      47  12.0    17               3
feb     110  50.0    31               9
mar     231  89.0    72              19
apr      87  87.0    20               7
may     132   NaN    52              11
jun     215  60.0    55              17

## Defining columns using other columns

In [93]:
eggs['salty_eggs'] = eggs.salt + eggs.dozens_of_eggs 
eggs

       eggs  salt  spam  dozens_of_eggs  salty_eggs
month
jan      47  12.0    17               3        15.0
feb     110  50.0    31               9        59.0
mar     231  89.0    72              19       108.0
apr      87  87.0    20               7        94.0
may     132   NaN    52              11         NaN
jun     215  60.0    55              17        77.0

## Using apply() to transform a column

In [96]:
weather = pd.read_csv('pittsburgh2013.csv')
weather.head(3)

,Date,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,Mean Dew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2013-1-1,32,28,21,30,27,16,100,89,77,...,10,6,2,10,8,NaN,0.0,8,Snow,277
1,2013-1-2,25,21,17,14,12,10,77,67,55,...,10,10,10,14,5,NaN,0.0,4,NaN,272
2,2013-1-3,32,24,16,19,15,9,77,67,56,...,10,10,10,17,8,26.0,0.0,3,NaN,229

In [97]:
# Write a function to convert degrees Fahrenheit to degrees Celsius: to_celsius
def to_celsius(F):
    return 5/9*(F - 32)

# Apply the function over 'Mean TemperatureF' and 'Mean Dew PointF': df_celsius
df_celsius = weather.loc[:, ['Mean TemperatureF','Mean Dew PointF']].apply(to_celsius)

# Reassign the column labels of df_celsius
df_celsius.columns = ['Mean TemperatureC', 'Mean Dew PointC']

# Print the output of df_celsius.head()
print(df_celsius.head())

   Mean TemperatureC  Mean Dew PointC
0          -2.222222        -2.777778
1          -6.111111       -11.111111
2          -4.444444        -9.444444
3          -2.222222        -7.222222
4          -1.111111        -6.666667

## Using .map() with a dictionary

In [98]:
# Create the dictionary: red_vs_blue
red_vs_blue = {'Obama':'blue', 'Romney':'red'}

# Use the dictionary to map the 'winner' column to the new column: election['color']
election['color'] = election.winner.map(red_vs_blue)

# Print the output of election.head()
print(election.head())

          state   total      Obama     Romney  winner  voters    turnout  \
county
Adams        PA   41973  35.482334  63.112001  Romney   61156  68.632677
Allegheny    PA  614671  56.640219  42.185820   Obama  924351  66.497575
Armstrong    PA   28322  30.696985  67.901278  Romney   42147  67.198140
Beaver       PA   80015  46.032619  52.637630  Romney  115157  69.483401
Bedford      PA   21444  22.057452  76.986570  Romney   32189  66.619031

              margin color
county
Adams      27.629667   red
Allegheny  14.454399  blue
Armstrong  37.204293   red
Beaver      6.605012   red
Bedford    54.929118   red

## Using vectorized functions

In [99]:
# Import zscore from scipy.stats
from scipy.stats import zscore

# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election['turnout'])

# Print the type of turnout_zscore
print(type(turnout_zscore))

# Assign turnout_zscore to a new column: election['turnout_zscore']
election['turnout_zscore'] = turnout_zscore 

# Print the output of election.head()
print(election.head())

<class 'numpy.ndarray'>
          state   total      Obama     Romney  winner  voters    turnout  \
county
Adams        PA   41973  35.482334  63.112001  Romney   61156  68.632677
Allegheny    PA  614671  56.640219  42.185820   Obama  924351  66.497575
Armstrong    PA   28322  30.696985  67.901278  Romney   42147  67.198140
Beaver       PA   80015  46.032619  52.637630  Romney  115157  69.483401
Bedford      PA   21444  22.057452  76.986570  Romney   32189  66.619031

              margin color  turnout_zscore
county
Adams      27.629667   red        0.853734
Allegheny  14.454399  blue        0.439846
Armstrong  37.204293   red        0.575650
Beaver      6.605012   red        1.018647
Bedford    54.929118   red        0.463391